<!DOCTYPE html>
<html lang="en">
<head>
	<meta charset="UTF-8">
	<title>PHP HomeWork 2</title>
	<style>
		body {
			padding-left: 10px;
		}
	</style>
</head>
<body>

<?php

	//Task 1
	echo "Task 1:" . "<br />";
		$a = 10;

		if ($a == 10) echo "Верно";
		else echo "Неверно";
	echo "<hr />" . "<br />";
	//-------------------------------------------

	//Task 2
	echo "Task 2:" . "<br />";
		$a = "1";
		// $a = 1;
		// $a = 3;

		if ($a === "1") echo "Верно";
		else echo "Неверно";
	echo "<hr />" . "<br />";
	//-------------------------------------------

	//Task 3
	echo "Task 3:" . "<br />";
		$a = "";
		// $a = 1;
		// $a = 3;
		// $a = -3;
		// $a = 0;
		// $a = null;
		// $a = true;
		// $a = "0";

		if (isset($a) === true) echo "Верно";
		else echo "Неверно";
	echo "<hr />" . "<br />";
	//-------------------------------------------

	//Task 4
	echo "Task 4:" . "<br />";
		$b;

		if (empty($b) == true) echo "Верно";
		else echo "Неверно";
	echo "<hr />" . "<br />";
	//-------------------------------------------

	//Task 5
	echo "Task 5:" . "<br />";
		$a = 122;
		echo $a % 5 . "<br />";
		echo $a % 3;
	echo "<hr />" . "<br />";
	//-------------------------------------------

	//Task 6
	echo "Task 6:" . "<br />";
		$a = 5;

		if ($a > 10) echo $a + 100;
		else echo $a - 30;
	echo "<hr />" . "<br />";
	//-------------------------------------------

	//Task 7
	echo "Task 7:" . "<br />";
		$a = 123;
		$b = (string) $a;
		$b[1] = "0";
		echo +$b;
	echo "<hr />" . "<br />";
	//-------------------------------------------

	//Task 8
	echo "Task 8:" . "<br />";
		$a = 3;

		if ($a > 0 && $a < 5) echo "Верно";
		else echo "Неверно";
	echo "<hr />" . "<br />";
	//-------------------------------------------

	//Task 9
	echo "Task 9:" . "<br />";
		$a = 1;
		$b = 3;

		if ($a <= 1 && $b >= 3) echo $a + $b;
		else echo $a - $b;
	echo "<hr />" . "<br />";
	//-------------------------------------------

	//Task 10
	echo "Task 10:" . "<br />";
		$a = 31;
		$b = 46;
		$c = 57;
		echo ($a + $b + $c) / 3 . "<br />";
		echo $a * 2 + $c * 2 - $b * 3;
	echo "<hr />" . "<br />";
	//-------------------------------------------

	//Task 11
	echo "Task 11:" . "<br />";
		$a = 25;
		echo $a * 9 / 5 + 32;
	echo "<hr />" . "<br />";
	//-------------------------------------------

	//Task 12
	echo "Task 12:" . "<br />";
		$a = "abcde";

		if ($a[0] == "a") echo "Да";
		else echo "Нет";
	echo "<hr />" . "<br />";
	//-------------------------------------------

	//Task 13
	echo "Task 13:" . "<br />";
		$a = 1;
		$b = 31;

		if ($a > 30 || $b > 30) echo "yes";
		else echo "no";
	echo "<hr />" . "<br />";
	//-------------------------------------------

	//Task 14
	echo "Task 14:" . "<br />";
		$a = 6;
		$b = 7;
		$c = 6;
		$d = 4;

		if ($a > 5 && $b > 5 && $c % 6 == 0 && $d % 3 != 0) echo "yes";
		else echo "no";
	echo "<hr />" . "<br />";
	//-------------------------------------------

	//Task 15
	echo "Task 15:" . "<br />";
		$a = " \"You are welcome!\"" . "<br />";

		for ($i = 1; $i <=10; $i++) echo $i . $a;
	echo "<hr />" . "<br />";
	//-------------------------------------------

	//Task 16
	echo "Task 16:" . "<br />";
		$a = "123123";

		if (+$a[0] + +$a[1] + +$a[2] == +$a[3] + +$a[4] + +$a[5]) echo "Да";
		else echo "Нет";
	echo "<hr />" . "<br />";
	//-------------------------------------------

	//Task 17
	echo "Task 17:" . "<br />";
		$a = 6;
		$b = -7;
		$c = 14;
		$d = 0;

		if ($a > 1) $d++;
		if ($b > 1) $d++;
		if ($c > 1) $d++;
		echo "Колличество положительных чисел: " . $d;
	echo "<hr />" . "<br />";
	//-------------------------------------------

	//Task 18
	echo "Task 18:" . "<br />";
		$a = 3;

		switch($a) {
			case 1:
				$result = "Зима";
			break;
			case 2:
				$result = "Весна";
			break;
			case 3:
				$result = "Лето";
			break;
			case 4:
				$result = "Осень";
			break;
		}
		echo $result;
	echo "<hr />" . "<br />";
	//-------------------------------------------

	//Task 19
	echo "Task 19:" . "<br />";
		$year = 2020;

		if (($year % 4 == 0 && $year % 100 > 0) || $year % 400 == 0) echo $year . " - Високосный год";
		else echo $year . " - Невисокосный год";
	echo "<hr />" . "<br />";
	//-------------------------------------------

	//Task 20
	echo "Task 20:" . "<br />";
		$lang = "en";
		$arrRu = ["Понедельник", "Вторник", "Среда", "Четверг", "Пятница", "Суббота", "Воскресенье"];
		$arrEn = ["Monday", "Tuesday", "Wednesday", "Thursday", "Friday", "Saturday", "Sunday"];

		switch($lang) {
			case "ru":
				print_r($arrRu);
			break;
			case "en":
				print_r($arrEn);
			break;
		}
	echo "<hr />" . "<br />";
	//-------------------------------------------

	//Task 21
	echo "Task 21:" . "<br />";
		$degree = 260;
		echo "Прошло " . floor($degree / 15) . " Часов ";
		echo $degree % 15 * 2 . " Минут";
	echo "<hr />" . "<br />";
	//-------------------------------------------


	//Task 22
	echo "Task 22:" . "<br />";
		$time = 65;
		$b = $time % 6;
		$time /= 6;
		$a = $time - (int)$time;
		echo ($a <= 0.5 && $b != 0) ? "Зеленый" : "Красный";
	echo "<hr />" . "<br />";
	//-------------------------------------------

	//Task 23
	echo "Task 23:" . "<br />";
		$a = 0;

		for($i = 20; $i <= 45; $i++) {
			if ($i % 5 == 0) $a += $i;
		}
		echo $a;
	echo "<hr />" . "<br />";
	//-------------------------------------------

	//Task 25
	echo "Task 25:" . "<br />";
		for($i = 0; $i <= 100; $i++) {
			echo $i . "<br />";
		}
		echo "<br />";

		$i = 0;
		while ($i <= 100) {
			echo $i . "<br />";
			$i++;
		}
		echo "<br />";

		$i = 0;
		do {
			echo $i . "<br />";
			$i++;
		} while ($i <= 100);
	echo "<hr />" . "<br />";
	//-------------------------------------------

	//Task 26
	echo "Task 26:" . "<br />";
		$a = 12345;
		$str = (string)$a;

		for($i = 0; $i < 5; $i++) {
			if(+$str[$i] % 2 == 0) $str[$i] = "0";
		}
		echo +$str;
	echo "<hr />" . "<br />";
	//-------------------------------------------

	//Task 27
	echo "Task 27:" . "<br />";
		for($i = 11; $i <= 33; $i++) {
			echo $i . "<br />";
		}
		echo "<br />";

		$i = 11;
		while ($i <= 33) {
			echo $i . "<br />";
			$i++;
		}
		echo "<br />";

		$i = 11;
		do {
			echo $i . "<br />";
			$i++;
		} while ($i <= 33);
	echo "<hr />" . "<br />";
	//-------------------------------------------

	//Task 28
	echo "Task 28:" . "<br />";
		$a = 123;
		$str = (string)$a;

		for($i = 2; $i >= 0; $i--) echo +$str[$i];
	echo "<hr />" . "<br />";
	//-------------------------------------------

	//Task 29
	echo "Task 29:" . "<br />";
		$num = 1000;
		$a = 0;

		for(;$num >= 50; $num /=2) {
			$a++;
		}
		echo $num . " Колличество итераций: " . $a; 
	echo "<hr />" . "<br />";
	//-------------------------------------------

	//Task 30
	echo "Task 30:" . "<br />";
		$num = 442158755745;
		$str = (string)$num;
		$a = 0;

		for($i = 0; $i < 12; $i++) {
			if ($str[$i] == "5") $a++;
		}
		echo $a;
	echo "<hr />" . "<br />";
	//-------------------------------------------

	//Task 31
	echo "Task 31:" . "<br />";
		$a = 5;
		$b = 8;

		for ($i = 1; $i <= 5; $i++) {
			for ($j = 1; $j <= 8; $j++) {
				echo "A";
			}
			echo "<br />";
		}
	echo "<hr />" . "<br />";
	//-------------------------------------------

	//Task 32
	echo "Task 32:" . "<br />";
		$a = 0;
		$b = 2;
		$c = 5;

		$aa = $a + $b;
			echo $aa ."<br/>";
		$bb = $c - $aa;
			echo $bb ."<br/>";
		$cc = $a + $b + $c;
			echo $cc ."<br/>";
	echo "<hr />" . "<br />";
	//-------------------------------------------

	//Task 33
	echo "Task 33:" . "<br />";
		$candy = 1000;
		$cookie = 1000;
		echo "Покупка А: " . ($candy * 0.3 + $cookie * 0.4);
		echo "<br />" . "Покупка B: " . ($candy * 2 + $cookie * 1.8) * 3;
	echo "<hr />" . "<br />";
	//-------------------------------------------

	//Task 34
	echo "Task 34:" . "<br />";
		$a = 13;
		$b = -1;

		if ($a == 11 && $b == -1 || $a == 14 && $b == 0 || $a == 13 && $b == 1) echo "Восток";
		if ($a == 12 && $b == -1 || $a == 11 && $b == 0 || $a == 14 && $b == 1) echo "Север";
		if ($a == 13 && $b == -1 || $a == 12 && $b == 0 || $a == 11 && $b == 1) echo "Запад";
		if ($a == 14 && $b == -1 || $a == 13 && $b == 0 || $a == 12 && $b == 1) echo "Юг";
	echo "<hr />" . "<br />";
	//-------------------------------------------

	//Task 35
	echo "Task 35:" . "<br />";
		$a = 5;

		for ($i = 1; $i <= $a; $i++) {
			for ($j = 1; $j <= $a; $j++) {
				echo "*";
			}
			echo "<br />";
		}
	echo "<hr />" . "<br />";
	//-------------------------------------------

	//Task 36
	echo "Task 36:" . "<br />";
		for ($i = 1001; $i <= 1025; $i += 3) {
			echo $i . " ";
		}
	echo "<hr />" . "<br />";
	//-------------------------------------------

	//Task 37
	echo "Task 37:" . "<br />";
		for ($i = 100; $i >= 0; $i -= 4) {
			echo $i . " ";
		}
	echo "<hr />" . "<br />";
	//-------------------------------------------

	//Task 38
	echo "Task 38:" . "<br />";
		$a = 10;
		$b = 0;

		for ($i = 1; $i <= 10; $i++) {
			$b += $a;
			$a *= 1.1;
			if ($i == 3) echo "Пробег лыжника за второй день: " . round($a, 1) . " км.";
			if ($i == 10) echo "<br />Пробег лыжника за десятый день: " . round($a, 1) . " км.";
			if ($i == 7) echo "<br />Пробег лыжника за первые семь дней: " . round($b, 1) . " км.";
			if ($b >= 80 && $b <= 95) echo "<br />На " . ($i - 1) . " день ему следует прекратить увеличивать пробег.";
		}
	echo "<hr />" . "<br />";
	//-------------------------------------------

?>

</body>
</html>